{
    "nome": "Guilherme",
    "raca": "Humano",
    "classe": "Mago",
    "tema": "Fantasia magica",
    "modo": "dnd5e",
    "historia": "Arquimago de level 15, treinado pelo antigo rei mago, o mais poderoso do mundo.",
    "nivel": 15,
    "experiencia": 0,
    "atributos": {
        "forca": 10,
        "destreza": 12,
        "constituicao": 12,
        "inteligencia": 16,
        "sabedoria": 16,
        "carisma": 11
    },
    "inventario": {
        "ouro": 2400,
        "vida_atual": 110,
        "vida_maxima": 110,
        "itens": [
            {
                "nome": "Cajado do Rei Antigo",
                "descricao": "Cajado legado pelo antigo rei mago, feito de ébano com runas douradas.",
                "propriedades": [
                    "+2 ao poder de magias ofensivas lançadas com o cajado",
                    "Foco arcano permanente (dispensa foco simples)",
                    "Armazena até 3 cargas de energia: cada carga restaura 30 de mana; recarrega 1 carga por dia ao amanhecer"
                ],
                "buffs": {
                    "inteligencia": 1
                }
            },
            {
                "nome": "Grimório do Arquimago",
                "descricao": "Livro de feitiços pessoal escrito pelo próprio Guilherme durante seu treinamento real.",
                "propriedades": [
                    "Contém 40 feitiços anotados (inclui rituais raros)",
                    "Permite preparar ou trocar 2 magias adicionais ao meditar"
                ]
            },
            {
                "nome": "Manto do Arquimago",
                "descricao": "Manto longo tecido com fios encantados do palácio real.",
                "propriedades": [
                    "+1 à proteção física",
                    "Redução mágica: receba -2 dano de efeitos mágicos não-lementares",
                    "Regeneração de mana passiva: +5 mana por minuto enquanto medita"
                ]
            },
            {
                "nome": "Anel de Memória Arcana",
                "descricao": "Anel simples com uma gema que pulsa com lembranças de fórmulas.",
                "propriedades": [
                    "Armazena um feitiço preparado (nível ≤ 5) para conjuração rápida uma vez por dia",
                    "Ajuda a evitar esquecimento de rituais complexos"
                ],
                "buffs": {
                    "carisma": 1
                }
            },
            {
                "nome": "Esferas de Mana",
                "descricao": "Bolsa com esferas cristalinas usadas para restauração imediata de energia arcana.",
                "quantidade": 3,
                "propriedades": [
                    "Cada esfera restaura 80 de mana ao ser consumida"
                ]
            },
            {
                "nome": "Poção Maior de Cura",
                "descricao": "Frasco com líquido vermelho brilhante preparado pelos curadores reais.",
                "quantidade": 2,
                "propriedades": [
                    "Cada poção restaura 50 de vida ao ser consumida"
                ]
            },
            {
                "nome": "Bolsa de Componentes",
                "descricao": "Pequena bolsa contendo componentes mundanos e raros para rituais.",
                "propriedades": [
                    "Contém componentes para a maioria dos feitiços de escola comum",
                    "Inclui uma pequena peça rara (símbolo do reino) usada em rituais de alta magia"
                ]
            },
            {
                "nome": "Selo de Autoridade Real",
                "descricao": "Amuleto com o brasão do antigo rei mago — sinal de autoridade e legado.",
                "propriedades": [
                    "Uma vez por dia, pode impor vantagem em testes de Carisma para influenciar criaturas mágicas ou servos leais",
                    "Usado como chave simbólica em locais ligados ao antigo reinado"
                ]
            },
            {
                "nome": "Mapa do Observatório Velado",
                "descricao": "Mapa antigo que indica a localização de uma torre esquecida ligada ao rei mago.",
                "propriedades": [
                    "Fonte de um gancho de aventura; revela passagens ocultas quando estudado por 1 hora"
                ]
            }
        ]
    },
    "magias": [
        {
            "nome": "Mísseis Mágicos",
            "nivel": 1,
            "descricao": "Projéteis de energia que nunca erram o alvo; ideal para garantir dano seguro."
        },
        {
            "nome": "Escudo Arcano",
            "nivel": 1,
            "descricao": "Barreira instantânea que aumenta a proteção e pode bloquear um ataque mágico imediato."
        },
        {
            "nome": "Detectar Magia",
            "nivel": 1,
            "descricao": "Permite identificar a presença e a escola de magia em objetos ou áreas próximas."
        },
        {
            "nome": "Imagem Espelhada",
            "nivel": 2,
            "descricao": "Cria cópias ilusórias do conjurador para confundir inimigos e reduzir acertos."
        },
        {
            "nome": "Invisibilidade",
            "nivel": 2,
            "descricao": "Torna um alvo imperceptível aos olhos comuns até que realize ação ofensiva."
        },
        {
            "nome": "Relâmpago",
            "nivel": 3,
            "descricao": "Rajada concentrada de eletricidade em linha, atravessa inimigos e objetos condutores."
        },
        {
            "nome": "Bola de Fogo",
            "nivel": 3,
            "descricao": "Explosão incendiária de grande área; assinatura de mago ofensivo experiente."
        },
        {
            "nome": "Contramágica",
            "nivel": 3,
            "descricao": "Interrompe ou bloqueia a conjuração de outro mago no momento-chave."
        },
        {
            "nome": "Muralha de Força",
            "nivel": 4,
            "descricao": "Barreira invisível e impenetrável para separar aliados de inimigos ou conter ameaças."
        },
        {
            "nome": "Tempestade Arcana",
            "nivel": 5,
            "descricao": "Invoca uma tormenta de energia pura que causa dano mágico contínuo em uma área ampla."
        },
        {
            "nome": "Porta Dimensional",
            "nivel": 5,
            "descricao": "Cria uma passagem curta entre dois pontos conhecidos, usada para transporte tático."
        },
        {
            "nome": "Manipulação Temporal (Rasgo)",
            "nivel": 7,
            "descricao": "Altera levemente o fluxo temporal ao redor de um alvo (lentidão/velocidade breve)."
        },
        {
            "nome": "Teleporte Longo",
            "nivel": 7,
            "descricao": "Permite deslocamento instantâneo a grandes distâncias entre locais conhecidos."
        },
        {
            "nome": "Selo do Rei Mago",
            "nivel": 9,
            "descricao": "Feitiço lendário ligado ao legado do antigo rei: cria um selo arcano de imenso poder que pode aprisionar, proteger ou devastar conforme a vontade do conjurador. Raro e exigente em mana; conhecimento obrigatório no Grimório Real."
        }
    ],
    "status": [],
    "spell_slots": {
        "1": {
            "total": 4,
            "usado": 2
        },
        "2": {
            "total": 3,
            "usado": 2
        },
        "7": {
            "total": 1,
            "usado": 1
        }
    }
}